artillery/postTest.yml
config:
  target: 'http://localhost:3003'
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - name: "POST Stress Test"
    flow:
      - post:
          url: "/api/restaurant/"
          json:
            restaurantName: "SHAM"
            restaurantRating: 5.0
            restaurantReviews: 3000
            restaurantPrice: "$30 Under"
            restaurantCuisine: "Chins"
            restaurantDescription: "DONT EAT HERE NOOOOOOOOOOO"
            restaurantTags: ["BAD IDEA", "FOOD NOT GOOD", "NONONONONO"]
            restaurantPhotos: ["https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39",
                              "https://i.kym-cdn.com/photos/images/facebook/001/101/745/c39" 
                            ]